using BenchmarkDotNet.Running;
using System;
using System.Collections.Generic;
using System.Linq;

namespace Vebinar4
{
    class Program
    {
        public static string[] listString = new string[10000];
        public static HashSet<string> addingHashSet = new HashSet<string>();

        static void Main(string[] args)
        {
            Random rnd = new Random();

            string[] templ = {"Иван", "Петр", "Егор", "Александр", "Алексей", "Евгений", "Геннадий",
            "Семен", "Лев", "Николай", "Сергей", "Платон", "Михаил", "Юрий", "Федор", "Роберт", "Владимир",
            "Мария", "Анна", "Валентина", "Лидия", "Александра", "Евгения", "Ирина",
            "Софья", "Людмила", "Ксения", "Виктория", "Марина", "Инна", "Светлана", "Яна", "Татьяна", "Ева",
            "Иванович", "Петрович", "Егорович", "Александрович", "Алексеевич",
            "Евгеньевич", "Геннадьевич", "Семенович", "Львович", "Николаевич", "Сергеевич", "Платонович",
            "Михайлович", "Юрьевич", "Федорович", "Робертович", "Владимирович",
            "Ивановна", "Петровна", "Егоровна", "Александровна", "Алексеевна",
            "Евгеньевна", "Геннадьевна", "Семеновна", "Львовна", "Николаевна", "Сергеевна", "Платоновна",
            "Михайловна", "Юрьевна", "Федоровна", "Робертовна", "Владимировна",
            "Аксенов", "Аронов", "Барсуков", "Багдасаров", "Варов", "Соколов", "Мячин",
            "Мазеев", "Матвиенко", "Нугманов", "Шульга", "Латеев", "Михайлов", "Полещук", "Нестерович", "Махнов",
            "Михайлова", "Спирина", "Кужелева", "Борисенок", "Глаговская", "Грибацкая",
            "Ходорова", "Лысенко", "Головина", "Щербакова", "Пачикина", "Мизонова", "Яцкевич", "Зорина", "Петухова",
            "Сварщик", "Слесарь", "Столяр", "Токарь", "Плиточник", "Крановщик", "Маляр", "Фрезеровщик", "Электрик",
            "Инженер III категории", "Инженер II категории", "Инженер III категории",
            "Служба главного инженера", "Управление охраны труда", "Управление качества и стратегического планирования", "Управление инновационной деятельности", "Монтажное",
            "Главный инженер", "Генеральный директор", "Директор производства", "Директор дирекции по персоналу", "Технический директор", "Директор УИТ" };

            

            for (int i = 0; i < 10000; i++)
            {
                string adding = (templ[rnd.Next(0, templ.Length)] + " " + templ[rnd.Next(0, templ.Length)] + " " + templ[rnd.Next(0, templ.Length)]);
                if(listString.Contains(adding))
                {
                    i--;
                    continue;
                }
                else
                {
                    listString[i] = adding;                    
                    addingHashSet.Add(adding);
                }                
            }

            BenchmarkSwitcher.FromAssembly(typeof(Program).Assembly).Run(args);
        }
    }
}
